# CreateLineStylePopup

## Description
Create a dialog control that displays the line style choices available in the active document.

```pascal
PROCEDURE CreateLineStylePopup(
				dialogID : LONGINT;
				itemID   : LONGINT);
```

```python

def vs.CreateLineStylePopup(dialogID, itemID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|itemID|LONGINT||

## Remarks
Create a dialog control that displays the line style choices available in the active document.

## Version
Availability: from VectorWorks12.0
## Category
* Dialogs - Modern